logs/20240610-035911-dummy_file.00001571/iodepth=8/rw=write/fio.log
job: (g=0): rw=write, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=8
fio-3.35
Starting 1 process

job: (groupid=0, jobs=1): err= 0: pid=85636: Mon Jun 10 04:06:42 2024
  write: IOPS=245, BW=123MiB/s (129MB/s)(10.0GiB/83513msec); 0 zone resets
    slat (usec): min=35, max=52074, avg=93.41, stdev=889.91
    clat (usec): min=1774, max=186973, avg=32509.56, stdev=21864.17
     lat (usec): min=1844, max=187076, avg=32602.97, stdev=21911.19
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    7], 10.00th=[   10], 20.00th=[   15],
     | 30.00th=[   20], 40.00th=[   25], 50.00th=[   29], 60.00th=[   33],
     | 70.00th=[   40], 80.00th=[   47], 90.00th=[   61], 95.00th=[   74],
     | 99.00th=[  111], 99.50th=[  124], 99.90th=[  157], 99.95th=[  167],
     | 99.99th=[  171]
   bw (  KiB/s): min=80896, max=186368, per=100.00%, avg=125699.08, stdev=18575.02, samples=166
   iops        : min=  158, max=  364, avg=245.51, stdev=36.28, samples=166
  lat (msec)   : 2=0.01%, 4=1.67%, 10=9.75%, 20=20.28%, 50=51.77%
  lat (msec)   : 100=15.09%, 250=1.43%
  cpu          : usr=0.16%, sys=1.62%, ctx=6006, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,20480,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=123MiB/s (129MB/s), 123MiB/s-123MiB/s (129MB/s-129MB/s), io=10.0GiB (10.7GB), run=83513-83513msec

Disk stats (read/write):
    md127: ios=0/20524, merge=0/0, ticks=0/666191, in_queue=666191, util=98.88%, aggrios=6546/13915, aggrmerge=195253/508990, aggrticks=52686/62747, aggrin_queue=117645, aggrutil=45.55%
  sdf: ios=6396/13990, merge=195876/511563, ticks=53650/68147, in_queue=123594, util=44.25%
  sdd: ios=6798/13774, merge=199468/508299, ticks=45383/48340, in_queue=95429, util=36.65%
  sdb: ios=6654/13992, merge=198185/511983, ticks=54192/57638, in_queue=114165, util=39.98%
  sdi: ios=6590/13825, merge=197105/508411, ticks=50379/65882, in_queue=117942, util=43.43%
  sdg: ios=6441/13749, merge=191532/506416, ticks=54807/71129, in_queue=128630, util=44.62%
  sde: ios=6505/13999, merge=193440/507478, ticks=53756/58458, in_queue=114524, util=38.97%
  sdc: ios=6561/14174, merge=193395/509686, ticks=53668/59495, in_queue=115410, util=39.66%
  sdh: ios=6424/13818, merge=193024/508087, ticks=55653/72890, in_queue=131473, util=45.55%